[TemplarDragon X2SoldierClassTemplate]
DisplayName="圣殿龙骑"
ClassSummary="火焰、闪电与火箭。龙骑将彻底摧毁敌人。"
AbilityTreeTitles[0]="专注之火"
AbilityTreeTitles[1]="雷霆之怒"
AbilityTreeTitles[2]="烈焰之息"
AbilityTreeTitles[3]="XCom"

RandomNickNames[0]="燃烧者"
RandomNickNames[1]="火炬手"
RandomNickNames[2]="地狱之火"
RandomNickNames[3]="火法师"
RandomNickNames[4]="火风暴"
RandomNickNames[5]="烈焰"
RandomNickNames[6]="大灾变"
RandomNickNames[7]="大灾难"
RandomNickNames[8]="大祸患"
RandomNickNames[9]="毁灭者"
RandomNickNames[10]="飞龙"

RandomNickNames_Male[0]="霸王龙"
RandomNickNames_Male[1]="火龙兽"
RandomNickNames_Male[2]="熔岩巨兽"
RandomNickNames_Male[3]="魔龙"

RandomNickNames_Female[0]="霸王花"
RandomNickNames_Female[1]="悍妇"
RandomNickNames_Female[2]="烈焰猫"